#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function_api.module.func_api.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "SIGNER_JWK_LIST_BASE64"                          = (sensitive value)
            # (18 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a4e96bcd-59dc-4d66-b2f7-5547ad157c12/resourceGroups/io-d-eudiw-rg-01/providers/Microsoft.Web/sites/io-d-itn-eudiw-api-func-01"
        name                                           = "io-d-itn-eudiw-api-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-eudiw-wpb/blob/main/infra/resources"
        }
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_api.module.func_api.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "SIGNER_JWK_LIST_BASE64"                          = (sensitive value)
            # (19 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a4e96bcd-59dc-4d66-b2f7-5547ad157c12/resourceGroups/io-d-eudiw-rg-01/providers/Microsoft.Web/sites/io-d-itn-eudiw-api-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-eudiw-wpb/blob/main/infra/resources"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_api.module.func_api_role.module.key_vault.azurerm_role_assignment.secrets["io-d-eudiw-rg-01|io-d-eudiw-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "66d3297e-9f66-4fc8-b1e1-fadb74bf48bc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a4e96bcd-59dc-4d66-b2f7-5547ad157c12/resourceGroups/io-d-eudiw-rg-01/providers/Microsoft.KeyVault/vaults/io-d-eudiw-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_api.module.func_api_slot_role[0].module.key_vault.azurerm_role_assignment.secrets["io-d-eudiw-rg-01|io-d-eudiw-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8a4ad626-a5cf-4456-8027-a16add530f77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a4e96bcd-59dc-4d66-b2f7-5547ad157c12/resourceGroups/io-d-eudiw-rg-01/providers/Microsoft.KeyVault/vaults/io-d-eudiw-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
